In [10]:
import pandas as pd

# DataFrame with test scores
data = {
    "Subject": ["Math", "Science", "English", "History"],
    "Mean_Score": [85, 78, 88, 92],
    "SD_Score": [5, 8, 6, 4]
}
scores = pd.DataFrame(data)

# Calculate CV for test scores
scores["CV"] = (scores["SD_Score"] / scores["Mean_Score"]) * 100

# Find the subject with the most consistent (min CV) and highest variability (max CV)
most_consistent = scores.loc[scores["CV"].idxmin()]
most_consistent
most_variable = scores.loc[scores["CV"].idxmax()]
most_variable
# # Print the insights
print(f"{most_consistent['Subject']} has the most consistent test scores (CV = {most_consistent['CV']:.2f}%).")
print(f"{most_variable['Subject']} has the highest variability (CV = {most_variable['CV']:.2f}%).")

History has the most consistent test scores (CV = 4.35%).
Science has the highest variability (CV = 10.26%).

In [11]:
import pandas as pd

# DataFrame of monthly sales performance
data = {
    "Employee": ["Alice", "Bob", "Charlie", "Diana"],
    "Mean_Sales": [45000, 52000, 48000, 50000],
    "SD_Sales": [4000, 10000, 2000, 6000]
}
sales_data = pd.DataFrame(data)

In [21]:
df["cv"]=sales_data.SD_Sales/sales_data.Mean_Sales

In [23]:
df["sd"]=sales_data['SD_Sales']

In [24]:
df

  Employee     mean        cv     sd
0    Alice  45000.0  0.088889   4000
1      Bob  52000.0  0.192308  10000
2  Charlie  48000.0  0.041667   2000
3    Diana  50000.0  0.120000   6000

In [25]:
df=df.iloc[:, [0,1,3,2]]

In [26]:
df

  Employee     mean     sd        cv
0    Alice  45000.0   4000  0.088889
1      Bob  52000.0  10000  0.192308
2  Charlie  48000.0   2000  0.041667
3    Diana  50000.0   6000  0.120000

In [39]:
consistent=df.loc[df['cv'].idxmin()]
variable=df.loc[df['cv'].idxmax()]

In [40]:
print(f" consistent employee of the year  {consistent['Employee']}  with {consistent['cv']:.2f}  ")
print(f"  most variable {variable['Employee']}  with variable sales {variable['cv']:.2f}%      ")

# print(f"{most_consistent['Employee']} has the most consistent sales performance (CV = {most_consistent['CV']:.2f}%).")

 consistent employee of the year  Charlie  with 0.04
  most variable Bob  with variable sales 0.19%

In [63]:
import pandas as pd

# Example fruit sales dataset
data = {
    "Fruit": ["Apple", "Banana", "Orange", "Apple", "Banana", "Apple", "Mango", "Orange", "Banana"],
    "Quantity": [50, 30, 20, 60, 40, 70, 10, 25, 35]
}
df = pd.DataFrame(data)

In [54]:
most_sold_fruit = df.groupby("Fruit")["Quantity"].sum().idxmax()
most_sold_fruit_count = df.groupby("Fruit")["Quantity"].sum().max()
print(f"{most_sold_fruit}:{most_sold_fruit_count}")

Apple:180

In [62]:
most_sold_fruit=df.groupby('Fruit')['Quantity'].agg(sum1='sum').reset_index()
most_sold_fruit

    Fruit  sum1
0   Apple   180
1  Banana   105
2   Mango    10
3  Orange    45

In [60]:
most_sold_fruit.loc[most_sold_fruit['sum1'].idxmax()]

Fruit    Apple
sum1       180
Name: 0, dtype: object

In [64]:
sold30=df.groupby('Fruit')['Quantity'].sum().reset_index(name='totalsale')

In [171]:
sold30

    Fruit  totalsale
0   Apple        180
1  Banana        105
2   Mango         10
3  Orange         45

In [68]:
print(f"total quantity{df.Quantity.sum()}")

total quantity340

In [172]:
sold30

    Fruit  totalsale
0   Apple        180
1  Banana        105
2   Mango         10
3  Orange         45

In [173]:
sold30['initial']=sold30['Fruit'].apply(lambda x: x[0] )

In [174]:
sold30

    Fruit  totalsale initial
0   Apple        180       A
1  Banana        105       B
2   Mango         10       M
3  Orange         45       O

In [178]:
sold30['initial1']=sold30['Fruit'].str.extract(r'([A-Za-z])')

In [179]:
sold30

    Fruit  totalsale initial initial1
0   Apple        180       A        A
1  Banana        105       B        B
2   Mango         10       M        M
3  Orange         45       O        O

In [180]:
sold30['startwitha']= sold30['Fruit'].apply(lambda x: 'YES' if x.startswith('A') else 'NO')

In [184]:
sold30.query('Fruit=="Apple" and initial=="A"')

   Fruit  totalsale initial initial1 startwitha
0  Apple        180       A        A        YES

In [185]:
sold30

    Fruit  totalsale initial initial1 startwitha
0   Apple        180       A        A        YES
1  Banana        105       B        B         NO
2   Mango         10       M        M         NO
3  Orange         45       O        O         NO

In [186]:
sold30['coddeee']=sold30['Fruit'].apply(lambda x:5.99 if x=='Apple' else 4.99 if x=='Banana' else 0)

In [187]:
sold30

    Fruit  totalsale initial initial1 startwitha  coddeee
0   Apple        180       A        A        YES     5.99
1  Banana        105       B        B         NO     4.99
2   Mango         10       M        M         NO     0.00
3  Orange         45       O        O         NO     0.00

In [66]:
final=sold30[sold30.totalsale>30]
print(final)

    Fruit  totalsale
0   Apple        180
1  Banana        105
3  Orange         45

In [69]:
print(df['Fruit'].nunique())

4

In [77]:
dfstd=df.groupby('Fruit')['Quantity'].std()
dfstd.idxmax()

'Apple'

In [89]:
df.loc[df['Fruit']=="Apple"]

   Fruit  Quantity
0  Apple        50
3  Apple        60
5  Apple        70

In [102]:

import pandas as pd

# Sample data
data = {
    "Fruit": ["Apple", "Banana", "Apple", "Mango", "Apple", "Banana"],
    "Quantity": [50, 30, 60, 40, 70, 35]
}
df = pd.DataFrame(data)

In [107]:
df=df.groupby('Fruit')['Quantity'].agg(total_sales='sum',average_sales='mean',standard_deviation='std').reset_index()

KeyError: 'Column not found: Quantity'

In [110]:
df.fillna(0,inplace=True)

In [111]:
df

    Fruit  total_sales  average_sales  standard_deviation
0   Apple          180           60.0           10.000000
1  Banana           65           32.5            3.535534
2   Mango           40           40.0            0.000000

In [118]:
df['cv']=(df['standard_deviation']/df['average_sales'])*100

In [119]:
df

    Fruit  total_sales  average_sales  standard_deviation         cv
0   Apple          180           60.0           10.000000  16.666667
1  Banana           65           32.5            3.535534  10.878566
2   Mango           40           40.0            0.000000   0.000000

In [146]:
import pandas as pd

# DataFrame with test scores
data = {
    "Subject": ["Math", "Science", "English", "History"],
    "Mean_Score": [85, 78, 88, 92],
    "SD_Score": [5, 8, 6, 4]
}
scores = pd.DataFrame(data)

# Calculate CV for test scores
scores["CV"] = (scores["SD_Score"] / scores["Mean_Score"]) * 100

In [147]:
scores

   Subject  Mean_Score  SD_Score         CV
0     Math          85         5   5.882353
1  Science          78         8  10.256410
2  English          88         6   6.818182
3  History          92         4   4.347826

In [148]:
minscore=scores["CV"].min()

In [158]:
min_values=scores.loc[scores["CV"].idxmin()]
x=min_values['Subject']

In [159]:
print(minscore,x)

4.3478260869565215 History

In [160]:
scores

   Subject  Mean_Score  SD_Score         CV
0     Math          85         5   5.882353
1  Science          78         8  10.256410
2  English          88         6   6.818182
3  History          92         4   4.347826

In [169]:
df['initial']=scores['Subject'].str.extract(r'([A-Za-z])')

In [170]:
df

Subject
English                           2
History                           3
Math                              0
Science                           1
initial       0
0  M
1  S
2  E
3  H
Name: CV, dtype: object